InformationRegisters/LN_МСРКэшМетаданных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>LN_МСРКэшМетаданных</Name>
			<Comment>TTL-кэш ответов tool-ов (get_metadata, describe_form, get_configuration). Ключ — md5 (имя_tool+JSON_аргументов).</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Ключ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокДействияСек</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/LN_МСРНастройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>LN_МСРНастройки</Name>
			<Comment>Серверные настройки LN_MCP_1C (формат ответа, лимиты токенов, режим execute_code, и т.п.)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Ключ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/LN_МСРКэш/Ext/Module.bsl
//LN++ Общий модуль LN_МСРКэш
// TTL-кэш ответов MCP-tools (особенно полезно для get_metadata, describe_form, get_configuration —
// они дороги по серверу, но почти не меняются между релизами конфигурации).
//
// Хранение: РегистрСведений.LN_МСРКэшМетаданных (Ключ -> Данные/ВремяСоздания/СрокДействияСек).
// Ключ — md5 от "ИмяТула|JSON(аргументов)".
//
//   Получить(ИмяТула, Аргументы)            -> Произвольный | Неопределено
//   Сохранить(ИмяТула, Аргументы, Данные, TTL = 600)
//   Очистить(Префикс = "")                  — служебная инвалидация
//

#Область ПрограммныйИнтерфейс

Функция Получить(ИмяТула, Аргументы) Экспорт

	Ключ = ВычислитьКлюч(ИмяТула, Аргументы);
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	КЭШ.Данные,
	|	КЭШ.ВремяСоздания,
	|	КЭШ.СрокДействияСек
	|ИЗ
	|	РегистрСведений.LN_МСРКэшМетаданных КАК КЭШ
	|ГДЕ
	|	КЭШ.Ключ = &Ключ");
	Запрос.УстановитьПараметр("Ключ", Ключ);
	Выборка = Запрос.Выполнить().Выбрать();
	Если НЕ Выборка.Следующий() Тогда
		Возврат Неопределено;
	КонецЕсли;
	Если ТекущаяДатаСеанса() > (Выборка.ВремяСоздания + Выборка.СрокДействияСек) Тогда
		УдалитьЗапись(Ключ);
		Возврат Неопределено;
	КонецЕсли;
	Если ТипЗнч(Выборка.Данные) = Тип("ХранилищеЗначения") Тогда
		Возврат Выборка.Данные.Получить();
	КонецЕсли;
	Возврат Выборка.Данные;

КонецФункции

Процедура Сохранить(ИмяТула, Аргументы, Данные, TTL = 600) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	Ключ = ВычислитьКлюч(ИмяТула, Аргументы);
	НаборЗаписей = РегистрыСведений.LN_МСРКэшМетаданных.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Ключ.Установить(Ключ);
	Запись = НаборЗаписей.Добавить();
	Запись.Ключ            = Ключ;
	Запись.Данные          = Новый ХранилищеЗначения(Данные);
	Запись.ВремяСоздания   = ТекущаяДатаСеанса();
	Запись.СрокДействияСек = TTL;
	НаборЗаписей.Записать();
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

// Возвращает значение из РегистрСведений.LN_МСРНастройки по ключу, либо ЗначениеПоУмолчанию.
// Используется всеми tools/контейнерами, которым нужна runtime-настройка
// (config_dump_path, default_response_format, audit_enabled, query_cursor_ttl_seconds, ...).
Функция ПолучитьНастройку(Ключ, ЗначениеПоУмолчанию = "") Экспорт

	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1 Настройки.Значение
	|ИЗ РегистрСведений.LN_МСРНастройки КАК Настройки
	|ГДЕ Настройки.Ключ = &Ключ");
	Запрос.УстановитьПараметр("Ключ", Ключ);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда Возврат Выборка.Значение; КонецЕсли;
	Возврат ЗначениеПоУмолчанию;

КонецФункции

Процедура Очистить(Префикс = "") Экспорт

	УстановитьПривилегированныйРежим(Истина);
	Если ЗначениеЗаполнено(Префикс) Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ Ключ ИЗ РегистрСведений.LN_МСРКэшМетаданных ГДЕ Ключ ПОДОБНО &Шаблон");
		Запрос.УстановитьПараметр("Шаблон", Префикс + "%");
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			УдалитьЗапись(Выборка.Ключ);
		КонецЦикла;
	Иначе
		НаборЗаписей = РегистрыСведений.LN_МСРКэшМетаданных.СоздатьНаборЗаписей();
		НаборЗаписей.Записать(Истина);
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ВычислитьКлюч(ИмяТула, Аргументы)

	Полезная = ИмяТула + "|" + LN_МСРКодирование.ЗначениеВJSON(Аргументы, Истина);
	ХешированиеДанных = Новый ХешированиеДанных(ХешФункция.MD5);
	ХешированиеДанных.Добавить(Полезная);
	Возврат НРег(СтрЗаменить(Строка(ХешированиеДанных.ХешСумма), " ", ""));

КонецФункции

Процедура УдалитьЗапись(Ключ)

	УстановитьПривилегированныйРежим(Истина);
	НаборЗаписей = РегистрыСведений.LN_МСРКэшМетаданных.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Ключ.Установить(Ключ);
	НаборЗаписей.Записать();
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

#КонецОбласти
//LN--
